import random


def help():
    return """-----------------------------------------------------------
Правила игры:
    Компьютер загадывает число от 1 до 20
    А вы угадываете его. Если вы не угадаете, 
    то компьютер подсказывает больше или меньше ВАШЕ ЧИСЛО.
-----------------------------------------------------------
Команды:
    'play' или '1' - Играть
    'help' или '2' - Помощь
    'exit' или '0' - Выход
-----------------------------------------------------------"""


def game():
    rand_number, num, n = random.randrange(1, 21), 0, 0
    while rand_number != num:
        inp = input("<I> Введите число: ")
        if inp.isdigit() and 1 <= int(inp) <= 20:
            num, n = int(inp), n + 1
            print(f"<W> {'Твое число больше' if num > rand_number else 'Твое число меньше' if num < rand_number else f'Вы угадали за {n} попыток'}\n")
        else:
            print("<E> Нужно ввести число от 1 до 20")


def main():
    print(f"""===========================================================
    Добро пожаловать в Мини-игру 'Угадай число'
{help()}
============================================================""")

    while True:
        inp = input("</> Введите команду: ")
        if inp in ("help", "2"):
            print(help())
        elif inp in ("play", "1"):
            game()
        elif inp in ("exit", "0"):
            break
        else:
            print("<E> Неправильная команда")
        

if __name__ == "__main__":
    main()